/*
1. Что такое HTML и для чего он используется?
    HTML - язык гипертекстовой разметки,скелет или каркас любой веб страницы содержащей разметку. Основная задача помочь браузеру как нкжно 
    отобразить 
    информацию и какого типа информация используется на странице.HTML стандартизированный язык позволяющий состовлять форматированный текст, 
    данный
    текст интерпретируется браузером, после чего браузер отображает его на экране в виде элементов веб страницы

2. Типы input элементов в HTML?
    В HTML для коммуникации с пользователем существует input элемент, который предназначен для получения вводимых данных. У него есть атрибут type 
    и в зависимости от значения этого атрибута будет применен тот или инной тип. Input type text самый распространненый вариант предназначенный 
    для вода букв  цифр и спк=ециальных символов. input type password используется для паролей, его особенность в том что вводимые символы 
    отображаются как звездочки.input type email предназначен для ввода email пользователя , если открыть намобильном телефоне то клавиатура будет 
    содержать специальные кнопки которые ускоряют ввод электронного адресса. input type number позволяет вводить только числовые значения при 
    фокусировки открывается клавиатура содержащая только цифры. input type button / input type submit поле для ввода превращается в кнопку 
    с помощью submit можно отправить форму. input type checkbox и input type radio - заменяют поле ввода на спец элементы.input type date / month /
    local  предназначены для ввода  даты  , такие типы полей могут содержать доп элементы в виде кнопок и выпадающего календаря

   
3. Что такое элемент canvas? И для чего он используется?
    HTML5 элемент который можно использовать для вставки изображений , градиентов и сложной анимации, а так же он создает область с помощью в
    которой  с помощью JS можно можно создавать различные обьекты , преобразовывать их

4. Что такое CSS-правило?
    CSS правило формируется из двух основных состовляющих  селектор - правило по которому будет происходить выборка правил для стилизации ,
     блок обьявления - это стуктура содержащая фигурные скобки внутри которых  описываются свойства и их значения
    

5. Разница между классом и идентификатором в CSS?
    для добавления стилей лучше использовать класс, а для добавления логики через JS оптимальнее применять id. id используются на странице только 
    один раз. id у элемента только один .У id больший вес для CSS (100). Class можно задавать много раз , у одного элемента может быть несколько 
    классов

6. Что такое CSS спрайт? И для чего он используется?
    CSS спрайт это картинка которая объединяет несколько изображений в одно большое.Обычно такой подход используетяс для специфичных наборов иконок
    В первую очередь это сокращает количество обращений к серверу т.к. вместо нескольких запросов достаточно сделать только один 

7. Как превратить любой тип данных в булевый? Перечислите ложные значения в JS?

8. Методы строк в JavaScript?

9. Методы массивов в JavaScript?


10. Разница между e.preventDefault() и e.stopPropagation()?


11. Методы поиска элементов в DOM?


12. Функция суммирования всех цифр числа?


















*/